app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" ORDER BY created_at DESC
---
  def index
    @posts = Post.all.order('created_at DESC')

INSERT INTO "posts" ("Ad", "Soyad", "Yas", "Adress", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["Ad", "Ada"], ["Soyad", "Boz"], ["Yas", 22], ["Adress", "Balıkesir"], ["created_at", "2020-07-24 10:29:03.448605"], ["updated_at", "2020-07-24 10:29:03.448605"]]
---
  def create
    @post=Post.new(post_params)
    if @post.save

UPDATE "posts" SET "Ad" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["Ad", "Ada'nın Postu"], ["updated_at", "2020-07-25 09:03:29.541749"], ["id", 6]]
---
  def update
    respond_to do |format|
      if @post.update(post_params)